Revit 2027 API
ParameterTypeId.ViewportScale Property
 "View Scale"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportScale { get; }
Public Shared ReadOnly Property ViewportScale As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportScale {
	ForgeTypeId^ get ();
}
static member ViewportScale : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace